/**
 * 如果兔子在出生两个月后，就有繁殖能力，一堆兔子每个月能生出一对小兔子，
 * 假设所有兔子都不死，那么一年后可以繁殖多少对兔子
 */
/*
------------------------------------------------------------------------------
所经过的月数  1   2   3   4   5   6   7   8   9   10  11  12
------------------------------------------------------------------------------
兔子对数     1   1   2   3   5   8   13  21  34   55  89  144
------------------------------------------------------------------------------

特点：前面相邻两项之和，构成了后一项
*/
#include <stdio.h>
int Fbi(int i)
{
    if (i < 2)
        return i == 0 ? 0 : 1;
    return Fbi(i - 1) + Fbi(i - 2);
}

int main()
{
    int i;
    for (int i = 0; i < 40; i++)
        printf("%d, ", Fbi(i));
    return 0;
}